Repository: ArnoldSchiller/hoerbuch
Catalog: locales/*/LC_MESSAGES/hoerbuch.po
Languages: de

source: show this help message and exit
de: zeige diese Hilfemeldung und beende

source: positional arguments
de: positionelle Argumente

source: optional arguments
de: Optionen

source: options
de: Optionen

source: usage:
de: Verwendung:

source: the following arguments are required: %s
de: die folgenden Argumente sind erforderlich: %s

source: Error: python-docx not found. Install with: sudo apt install python3-docx
de: Fehler: python-docx nicht gefunden. Installieren mit: sudo apt install python3-docx

source: Error: python3-odf not found. Install with: sudo apt install python3-odf
de: Fehler: python3-odf nicht gefunden. Installieren mit: sudo apt install python3-odf

source: Error: python3-ebooklib not found. Install with: pip install ebooklib
de: Fehler: python3-ebooklib nicht gefunden. Installieren mit: pip install ebooklib

source: Error: Unsupported file extension '{ext}'. Supported: .txt, .docx, .odt, .epub.
de: Fehler: Nicht unterstützte Dateiendung '{ext}'. Unterstützt: .txt, .docx, .odt, .epub.

source: Error during document parsing: {msg}
de: Fehler beim Parsen des Dokuments: {msg}

source: Error: Input file '{file}' not found.
de: Fehler: Eingabedatei '{file}' nicht gefunden.

source: Critical error: {msg}
de: Kritischer Fehler: {msg}

source: Fatal: Voice model '{file}' not found in any path (including script/models and install dir).
de: Fatal: Sprachmodell '{file}' wurde in keinem Pfad gefunden (einschließlich script/models und Installationsverzeichnis).

source: Warning: Explicit voice file not found at '{file}'. Trying defaults...
de: Warnung: Explizite Sprachdatei nicht gefunden unter '{file}'. Versuche Standardwerte...

source: Segment {n}
de: Abschnitt {n}

source: TXT detected. Extracting segments...
de: TXT erkannt. Extrahiere Segmente...

source: DOCX detected. Extracting segments...
de: DOCX erkannt. Extrahiere Segmente...

source: ODT detected. Extracting segments...
de: ODT erkannt. Extrahiere Segmente...

source: EPUB detected. Extracting chapters...
de: EPUB erkannt. Extrahiere Kapitel...

source: Warning: Document contains no extractable text segments.
de: Warnung: Dokument enthält keine extrahierbaren Textsegmente.

source: Using title: '{title}', artist: '{artist}'
de: Verwende Titel: '{title}', Künstler: '{artist}'

source: Loading voice from: {file}
de: Lade Stimme von: {file}

source: Using voice from: {file}
de: Verwende Stimme von: {file}

source: Synthesizing ({n} characters in {m} segments)...
de: Synthetisiere ({n} Zeichen in {m} Segmenten)...

source: -> TTS speed adjusted to: {speed} (1.0 = normal)
de: -> TTS-Geschwindigkeit angepasst auf: {speed} (1.0 = normal)

source: -> Segment started: {title} at {time:.2f}s
de: -> Segment gestartet: {title} bei {time:.2f}s

source: -> Synthesizing chapter: '{title}'
de: -> Synthetisiere Kapitel: '{title}'

source: ✅ Chapter markers and metadata written to OGG Vorbis comments.
de: ✅ Kapitel-Marker und Metadaten in OGG Vorbis-Kommentare geschrieben.

source: ✅ OGG file successfully written: {file}
de: ✅ OGG-Datei erfolgreich geschrieben: {file}

source: Total duration: {time:.2f}s
de: Gesamtdauer: {time:.2f}s

source: Warning: Failed to write OGG Vorbis markers: {msg}
de: Warnung: Konnte OGG Vorbis-Marker nicht schreiben: {msg}

source: Warning: Failed to write OGG Vorbis metadata for single chapter: {msg}
de: Warnung: Konnte OGG Vorbis-Metadaten für einzelnes Kapitel nicht schreiben: {msg}

source: Attempting to read custom markers from existing OGG file...
de: Versuche benutzerdefinierte Marker aus existierender OGG-Datei zu lesen...

source: ✅ Successfully read {n} precise markers from OGG file.
de: ✅ Erfolgreich {n} präzise Marker aus OGG-Datei gelesen.

source: Calculating approximate markers from existing OGG file...
de: Berechne ungefähre Marker aus existierender OGG-Datei...

source: Error reading OGG duration for marker calculation: {msg}
de: Fehler beim Lesen der OGG-Dauer für Marker-Berechnung: {msg}

source: -> Approximate segment start: {title} at {time:.2f}s
de: -> Ungefährer Segmentstart: {title} bei {time:.2f}s

source: Total approximate duration used for calculation: {time:.2f}s
de: Gesamte ungefähre Dauer für Berechnung verwendet: {time:.2f}s

source: Fatal: ffmpeg is required for MP3 conversion but was not found. Please install ffmpeg.
de: Fatal: ffmpeg wird für MP3-Konvertierung benötigt, wurde aber nicht gefunden. Bitte installieren Sie ffmpeg.

source: Converting OGG to MP3 (CBR 320k)...
de: Konvertiere OGG zu MP3 (CBR 320k)...

source: ✅ MP3 file successfully converted: {file}
de: ✅ MP3-Datei erfolgreich konvertiert: {file}

source: → Temporary OGG file deleted: {file}
de: → Temporäre OGG-Datei gelöscht: {file}

source: Error during MP3 conversion (ffmpeg failed): {msg}
de: Fehler bei MP3-Konvertierung (ffmpeg fehlgeschlagen): {msg}

source: Error: ffmpeg command not found.
de: Fehler: ffmpeg-Befehl nicht gefunden.

source: Writing chapter markers and metadata to MP3...
de: Schreibe Kapitel-Marker und Metadaten in MP3...

source: ✅ Metadata written successfully (Title: '{title}', Artist: '{artist}').
de: ✅ Metadaten erfolgreich geschrieben (Titel: '{title}', Künstler: '{artist}').

source: Error writing MP3 chapter tags: {msg}
de: Fehler beim Schreiben der MP3-Kapitel-Tags: {msg}

source: Please ensure required libraries are installed and the file is valid.
de: Bitte stellen Sie sicher, dass die benötigten Bibliotheken installiert sind und die Datei gültig ist.

source: Error writing simple MP3 tags: {msg}
de: Fehler beim Schreiben einfacher MP3-Tags: {msg}

source: -> MP3 tagged: {file}
de: -> MP3 getaggt: {file}

source: [Chapter mode: direct chapter {n} - '{title}']
de: [Kapitelmodus: direktes Kapitel {n} - '{title}']

source: Warning: output file already exists: {file}
de: Warnung: Ausgabedatei existiert bereits: {file}

source: Warning: chapter {n} not found (document has {m} chapters).
de: Warnung: Kapitel {n} nicht gefunden (Dokument hat {m} Kapitel).

source: ✨ Interactive chapter mode started ✨
de: ✨ Interaktiver Kapitelmodus gestartet ✨

source: {n} chapters detected:
de: {n} Kapitel erkannt:

source: Options:
de: Optionen:

source: [a] All chapters in ONE OGG file (with chapter markers)
de: [a] Alle Kapitel in EINER OGG-Datei (mit Kapitel-Markern)

source: [s] Split chapters: ONE file per chapter
de: [s] Kapitel aufteilen: EINE Datei pro Kapitel

source: [<number>] Synthesize a single specific chapter (e.g. '2')
de: [<Zahl>] Synthetisiere ein einzelnes spezifisches Kapitel (z.B. '2')

source: Your choice:
de: Ihre Auswahl:

source: → Synthesizing all chapters into a combined OGG...
de: → Synthetisiere alle Kapitel in eine kombinierte OGG-Datei...

source: ✅ Combined synthesis finished.
de: ✅ Kombinierte Synthese abgeschlossen.

source: → Synthesizing each chapter to separate files...
de: → Synthetisiere jedes Kapitel in separate Dateien...

source: Skipping chapter '{title}': output file '{file}' already exists.
de: Überspringe Kapitel '{title}': Ausgabedatei '{file}' existiert bereits.

source: Error synthesizing chapter {n} ('{title}'): {msg}
de: Fehler beim Synthetisieren von Kapitel {n} ('{title}'): {msg}

source: ✅ All chapters processed in split-file mode.
de: ✅ Alle Kapitel im Aufteilungsmodus verarbeitet.

source: ✅ Single chapter finished.
de: ✅ Einzelnes Kapitel abgeschlossen.

source: Invalid selection, aborting.
de: Ungültige Auswahl, breche ab.

source: Continuing with standard single-file synthesis (no chapter mode).
de: Fahre mit Standard-Einzeldatei-Synthese fort (kein Kapitelmodus).

source: Existing OGG file found. Reusing for fast MP3 conversion.
de: Existierende OGG-Datei gefunden. Verwende sie für schnelle MP3-Konvertierung.

source: → Using precise markers from OGG for MP3 tagging.
de: → Verwende präzise Marker aus OGG für MP3-Tagging.

source: → Warning: No OGG markers found. Estimating markers from text length.
de: → Warnung: Keine OGG-Marker gefunden. Schätze Marker aus Textlänge.

source: 🛑 Output file '{file}' already exists. Skipping synthesis/conversion.
de: 🛑 Ausgabedatei '{file}' existiert bereits. Überspringe Synthese/Konvertierung.

source: → Please rename or delete the existing file if you wish to regenerate the audio.
de: → Bitte benennen Sie die existierende Datei um oder löschen Sie sie, wenn Sie das Audio neu generieren möchten.

source: → Temporary OGG file deleted after error.
de: → Temporäre OGG-Datei nach Fehler gelöscht.

source: → Partial MP3 file deleted after error.
de: → Partielle MP3-Datei nach Fehler gelöscht.

source: Unknown Title
de: Unbekannter Titel

source: Unknown
de: Unbekannt

source: Convert text documents (.txt, .docx, .odt, .epub) to OGG audio using Piper TTS, with optional MP3 conversion and chapter control.
de: Konvertiere Textdokumente (.txt, .docx, .odt, .epub) zu OGG-Audio mit Piper TTS, mit optionaler MP3-Konvertierung und Kapitelsteuerung.

source: Show debug messages
de: Zeige Debug-Nachrichten

source: Input file path (.txt, .docx, .odt, .epub)
de: Eingabedatei-Pfad (.txt, .docx, .odt, .epub)

source: Optional ONNX voice file path
de: Optioneller ONNX-Sprachdatei-Pfad

source: Convert OGG output to MP3 format with chapter tags (requires ffmpeg)
de: Konvertiere OGG-Ausgabe in MP3-Format mit Kapitel-Tags (benötigt ffmpeg)

source: TTS speech rate multiplier (1.0 = normal, 0.9 = slower)
de: TTS-Sprachgeschwindigkeits-Multiplikator (1.0 = normal, 0.9 = langsamer)

source: Interactive (-k) or direct chapter (e.g. -k 5). Position independent.
de: Interaktiv (-k) oder direktes Kapitel (z.B. -k 5). Positionsunabhängig.

source: Examples:
de: Beispiele:

source: %(prog)s book.epub # Convert EPUB to OGG
de: %(prog)s book.epub # Konvertiere EPUB zu OGG

source: %(prog)s -m -s 0.9 document.docx # Convert to MP3 with slower speed
de: %(prog)s -m -s 0.9 document.docx # Konvertiere zu MP3 mit langsamerer Geschwindigkeit

source: %(prog)s book.epub -k -1 # Interactive chapter selection
de: %(prog)s book.epub -k -1 # Interaktive Kapitelauswahl

source: %(prog)s book.epub -k 3 # Convert only chapter 3
de: %(prog)s book.epub -k 3 # Konvertiere nur Kapitel 3

source: %(prog)s -k 3 book.epub # Also accepted (position independent)
de: %(prog)s -k 3 book.epub # Auch akzeptiert (positionsunabhängig)

source: -> OGG saved: {file} (Duration: {time:.2f}s)
de: -> OGG gespeichert: {file} (Dauer: {time:.2f}s)
